{
    "sections": [
      {
        "title": "About Us",
        "content": "The Company is constantly looking for innovative businesses to learn and grow. A good business opportunity emerged at Tuticorin Port Trust for construction of new berths to berth large vessels. The nature of business being underwater dredging and blasting in the deep sea using explosives. Since the skill required being new, the Company engaged Specialists as advisors and learned the new skill, completing the Project on time. All the Projects were executed either on time or well in advance which has improved the Company's reputation in the market",
        "image": "assets/ADS18041.JPG"
      },
      {
        "title": "Infrastructure - Road Projects",
        "content": "Later the Company entered in road projects, major one being complete earth work contract (excavation and transportation) for Ms. IJM- Sathyam who bagged from NHAI, Tambaram - Maduravoyal Chennai by-pass road.",
        "image": "assets/ADS18005.JPG"
      },
      {
        "title": "Infrastructure - Port",
        "content": "The Company is constantly looking for innovative businesses to learn and grow. A good business opportunity emerged at Tuticorin Port Trust for construction of new berths to berth large vessels. The nature of business being underwater dredging and blasting in the deep sea using explosives. Since the skill required being new, the Company engaged Specialists as advisors and learned the new skill, completing the Project on time. All the Projects were executed either on time or well in advance which has improved the Company's reputation in the market",
        "image": "assets/ADS18043.JPG"
      },
      {
        "title": "Primary Sector - Mining",
        "content": "Large opportunities emerged in Eastern and Central parts of the Country and the Company is looking for larger growth opportunities in Mining Projects, in association with Tata Steel, Rungta Mining, Ms. GS Atwal & Co Ltd.,KNR mining (Atha Group, Kolkata) and started working in Chromate ore, Iron ore, etc. This being a stepping stone for the Company to learn new business skills for enlarging the growth. After 17 years in this area, the Company moved over to Coal mining in 2014 through associations with Ms. BLA Projects Ltd., Ms. BLA infra projects Ltd., Ms. Mahalakshmi Infra Projects Ltd., etc and associated with PSU like Ms. Mahanadhi CoalFields Ltd., (MCL) in Odisha, which is being a subsidiary Company of Ms. Coal India Ltd., Kolkata, which comes under the Ministry of Coal and Power. The Company emerged as a Preferred Contractor with Ms. Tata Steel (SCM) Ltd., and Ms. Mahanadi Coalfields Ltd.",
        "image": "assets/ADS18038.JPG"
      },
      {
        "title": "Team",
        "content": "Our team strength has grown from 5 personnel to 1000 personnel in this span. Our skill requirements on various positions range from Project Incharge, Heads of Department, Engineers, etc.",
        "image": "assets/ADS18001.JPG"
      }
    ]
  }